
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Наименование = NAME;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Облигации.Код
		|ИЗ
		|	Справочник.Облигации КАК Облигации
		|ГДЕ
		|	Облигации.Ссылка <> &Ссылка
		|	И Облигации.SECID = &SECID
		|	И Облигации.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("SECID", SECID);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						        	НСтр("ru='Тикер с SECID <%1> уже присутствует в справочнике'"),
						        	SECID);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
