
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.SECID.ТолькоПросмотр = НЕ Объект.Ссылка.Пустая(); 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура SECIDОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	Сообщить("SECIDОкончаниеВводаТекста Старт");
//	ЗагрузитьС_MOEXНаСервере(Текст);
//	Сообщить("SECIDОкончаниеВводаТекста Конец");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьС_MOEX(Команда)
	ЗагрузитьС_MOEXНаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗагрузитьС_MOEXНаСервере(Текст=Неопределено)
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СправочникОбъект.ЗагрузитьС_MOEX(Текст);
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
КонецПроцедуры

#КонецОбласти