
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.SECID.ТолькоПросмотр = НЕ Объект.Ссылка.Пустая(); 
	СсылкаMOEX = БондОбщий.СсылкаНаТикер(Объект.SECID);
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти


//@skip-check module-region-empty
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаMOEXНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(СсылкаMOEX);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьС_MOEX(Команда)
	ЗагрузитьС_MOEXНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗагрузитьС_MOEXНаСервере(Текст=Неопределено)
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	БондОбщий.ЗагрузитьС_MOEX(Текст, СправочникОбъект);
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	СсылкаMOEX = БондОбщий.СсылкаНаТикер(СправочникОбъект.SECID);
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	Если Объект.GROUP = "stock_etf" Тогда
		Элементы.FACEUNIT.Доступность = Ложь;
		Элементы.FACEVALUE.Доступность = Ложь;
		Элементы.ISSUESIZE.Доступность = Ложь;
	Иначе
		Элементы.FACEUNIT.Доступность = Истина;
		Элементы.FACEVALUE.Доступность = Истина;
		Элементы.ISSUESIZE.Доступность = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти