
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьСуммы()
	Объект.Сумма = Объект.Цена * Объект.Количество;
	Объект.СуммаПолная = Объект.Сумма + Объект.Комиссия;	
КонецПроцедуры
#КонецОбласти