
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТипСделкиПриИзменении(Элемент)
	ОбновитьСуммы();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьСуммы()
	Объект.Сумма = Объект.Цена * Объект.Количество;
	Если Объект.ТипСделки = Перечисления.ТипСделки.Покупка Тогда
		Объект.СуммаПолная = Объект.Сумма + Объект.Комиссия;		
	Иначе
		Объект.СуммаПолная = Объект.Сумма - Объект.Комиссия;		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти