
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипСделкиПриИзменении(Элемент)
	ОбновитьСуммыПоТЧ();
	ОбновитьСуммыШапки();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСделки
&НаКлиенте
Процедура СделкиКоличествоПриИзменении(Элемент)
	ОбновитьСуммыПоСтроке();
	ОбновитьСуммыШапки();
КонецПроцедуры

&НаКлиенте
Процедура СделкиЦенаПриИзменении(Элемент)
	ОбновитьСуммыПоСтроке();
	ОбновитьСуммыШапки();
КонецПроцедуры

&НаКлиенте
Процедура СделкиКомиссияПриИзменении(Элемент)
	ОбновитьСуммыПоСтроке();
	ОбновитьСуммыШапки();
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьСуммыШапки()
	Объект.Сумма = Объект.Сделки.Итог("Сумма");
	Объект.СуммаПолная = Объект.Сделки.Итог("СуммаПолная");
	Объект.Комиссия = Объект.Сделки.Итог("Комиссия");
	Объект.Количество = Объект.Сделки.Итог("Количество");
	Объект.Цена = Объект.Сумма / Объект.Количество; 
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммыПоТЧ()
	Для Каждого ТекСтрока Из Объект.Сделки Цикл
		ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
		
		Если Объект.ТипСделки = Перечисления.ТипСделки.Покупка Тогда
			ТекСтрока.СуммаПолная = ТекСтрока.Сумма + ТекСтрока.Комиссия;		
		Иначе
			ТекСтрока.СуммаПолная = ТекСтрока.Сумма - ТекСтрока.Комиссия;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


//Процедура ОбновитьСуммы()
//	Объект.Сумма = Объект.Цена * Объект.Количество;
//	Если Объект.ТипСделки = Перечисления.ТипСделки.Покупка Тогда
//		Объект.СуммаПолная = Объект.Сумма + Объект.Комиссия;		
//	Иначе
//		Объект.СуммаПолная = Объект.Сумма - Объект.Комиссия;		
//	КонецЕсли;
//КонецПроцедуры


&НаСервере
Процедура ОбновитьСуммыПоСтроке()
	ТекСтрока = Объект.Сделки.Получить(Элементы.Сделки.ТекущаяСтрока);
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	
	Если Объект.ТипСделки = Перечисления.ТипСделки.Покупка Тогда
		ТекСтрока.СуммаПолная = ТекСтрока.Сумма + ТекСтрока.Комиссия;		
	Иначе
		ТекСтрока.СуммаПолная = ТекСтрока.Сумма - ТекСтрока.Комиссия;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти